<a href="https://colab.research.google.com/github/JimKing100/SF_Real_Estate_Project/blob/master/National_Salary_vs_Housing.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [63]:
import pandas as pd
import math

# Load the tech income data
salary_data = pd.read_csv('https://raw.githubusercontent.com/JimKing100/SF_Real_Estate_Project/master/data/RankedTechIncome.csv')

# Check the data
print(salary_data.shape)
salary_data.head()

(385, 23)

  PRIM_STATE   AREA  ...  A_PCT75  A_PCT90
0         CA  41940  ...  157,940  192,300
1         CA  41860  ...  149,270  179,900
2         WA  42660  ...  142,920  168,140
3         DC  47900  ...  134,500  161,750
4         NH  76900  ...  126,640  155,160

[5 rows x 23 columns]

In [64]:
# Load the tech income data
initial_data = pd.read_csv('https://raw.githubusercontent.com/JimKing100/SF_Real_Estate_Project/master/data/2018MedianHomes-Final.csv')

housing_data = initial_data.rename(columns={'CBSA Code': 'AREA'})

# Check the data
print(housing_data.shape)
housing_data.head()

(180, 5)

    AREA                         Metro Area   2016   2017   2018
0  19500                        Decatur, IL   93.3   94.4   90.8
1  49660  Youngstown-Warren-Boardman, OH-PA   84.4   86.1   94.0
2  19060                  Cumberland, MD-WV   88.8   90.7  100.5
3  21300                         Elmira, NY  116.1  110.4  111.2
4  21500                           Erie, PA  114.9  115.7  118.7

In [65]:
merged_data = pd.merge(salary_data,
                       housing_data,
                       on='AREA')
merged_data.head()

  PRIM_STATE   AREA  ...    2017    2018
0         CA  41940  ...  1180.0  1340.0
1         CA  41860  ...   900.0   987.5
2         WA  42660  ...   465.8   501.4
3         DC  47900  ...   406.7   424.0
4         NY  35620  ...   404.3   410.0

[5 rows x 27 columns]

In [66]:
temp_df = pd.DataFrame(merged_data, columns = ['AREA' , 'Metro Area', '2018' , 'A_MEAN'])
temp_df.head()

    AREA                                    Metro Area    2018  A_MEAN
0  41940            San Jose-Sunnyvale-Santa Clara, CA  1340.0  127040
1  41860             San Francisco-Oakland-Hayward, CA   987.5  120730
2  42660                   Seattle-Tacoma-Bellevue, WA   501.4  113750
3  47900  Washington-Arlington-Alexandria, DC-VA-MD-WV   424.0  107760
4  35620         New York-Newark-Jersey City, NY-NJ-PA   410.0  103960

In [67]:
final_df = temp_df.rename(columns={'AREA': 'cbsa_code', 'Metro Area': 'metro_area',
                                   '2018': 'median_home_price', 'A_MEAN': 'tech_salary'})
final_df.head()

   cbsa_code  ... tech_salary
0      41940  ...      127040
1      41860  ...      120730
2      42660  ...      113750
3      47900  ...      107760
4      35620  ...      103960

[5 rows x 4 columns]

In [68]:
final_df.loc[:,'median_home_price'] *= 1000
final_df = final_df.astype({'median_home_price': 'int'})
final_df.head()

   cbsa_code  ... tech_salary
0      41940  ...      127040
1      41860  ...      120730
2      42660  ...      113750
3      47900  ...      107760
4      35620  ...      103960

[5 rows x 4 columns]

In [69]:
# Function to calculate the monthly housing payment (PITI)
def minimum_income(median_price):
    int_rate = .04
    term = 30
    down_pmt = .20
    principal_pmt = median_price * (1 - down_pmt)
    
    # Calculate insurance and taxes
    tax_pmt = (median_price * .01) / 12
    insurance_pmt = (median_price * .0038) / 12
    
    # monthly rate from annual percentage rate
    interest_rate = int_rate/(100 * 12)
    
    # total number of payments
    payment_num = term * 12
    
    # calculate monthly mortgage payment
    mortgage_pmt = principal_pmt * (interest_rate * (math.pow((1 + interest_rate), (payment_num))) / 
                               (math.pow((1 + interest_rate), (payment_num)) - 1))
    payment = mortgage_pmt + tax_pmt + insurance_pmt
    min_income = (payment / .30) * 12
    
    return min_income

final_df['min_income'] = final_df.apply(lambda x: minimum_income(x['median_home_price']), axis=1)
final_df = final_df.astype({'min_income': 'int'})
final_df.head(20)

    cbsa_code  ... min_income
0       41940  ...     181469
1       41860  ...     133731
2       42660  ...      67901
3       47900  ...      57420
4       35620  ...      55524
5       12580  ...      38677
6       14500  ...      82257
7       41740  ...      85859
8       19740  ...      60927
9       26620  ...      27816
10      17820  ...      42279
11      26420  ...      32339
12      45940  ...      33246
13      19100  ...      35210
14      18140  ...      27328
15      12420  ...      42780
16      37980  ...      31012
17      20500  ...      37783
18      39580  ...      38406
19      12060  ...      29779

[20 rows x 5 columns]

In [70]:
final_df['differential'] = final_df.apply(lambda x: x['tech_salary'] - x['min_income'], axis=1)
final_df.head(20)

    cbsa_code  ... differential
0       41940  ...       -54429
1       41860  ...       -13001
2       42660  ...        45849
3       47900  ...        50340
4       35620  ...        48436
5       12580  ...        62833
6       14500  ...        18963
7       41740  ...        14031
8       19740  ...        37533
9       26620  ...        69524
10      17820  ...        53411
11      26420  ...        63181
12      45940  ...        60944
13      19100  ...        58610
14      18140  ...        65112
15      12420  ...        49190
16      37980  ...        60808
17      20500  ...        53957
18      39580  ...        53274
19      12060  ...        61441

[20 rows x 6 columns]